app/controllers/api/tracks_controller.rb

INSERT INTO "tracks" ("title", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "kekky"], ["creator_id", 1], ["created_at", "2021-02-14 22:29:50.433884"], ["updated_at", "2021-02-14 22:29:50.433884"]]
---
    def create
        @track = Track.new(track_params)
        @track.creator_id = current_user.id
        if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "tracks" SET "title" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["title", "Monolith AAAA"], ["updated_at", "2021-02-15 21:19:00.876320"], ["id", 6]]
---
    def update
        @track = Track.find(params[:id])

        if @track.update(track_params)